#+TITLE: APISnoop v3 Database

* Ensure connectivity to right database
  
#+NAME: Start Postgresql Connection
#+BEGIN_SRC emacs-lisp :results silent
  ;; (sql-connect connection (concat "*SQL: postgres:data*"))
  (sql-connect "hasura" (concat "*SQL: postgres:data*"))
#+END_SRC

#+BEGIN_SRC sql-mode
  \conninfo
#+END_SRC

#+RESULTS:
#+begin_src sql-mode
You are connected to database "data" as user "hh" on host "172.17.0.1" at port "5432".
SSL connection (protocol: TLSv1.3, cipher: TLS_AES_256_GCM_SHA384, bits: 256, compression: off)
#+end_src

#+BEGIN_SRC sql-mode
select 'drop table if exists "' || tablename || '" cascade;' from pg_tables;
#+END_SRC

#+BEGIN_SRC sql-mode
  drop table if exists "event_log" cascade;
  drop table if exists "job_logs" cascade;
  drop table if exists "audit_events" cascade;
  drop table if exists "object_refs" cascade;
  drop table if exists "response_statuses" cascade;
  drop table if exists "users_info" cascade;
#+END_SRC

#+RESULTS:
#+begin_example
NOTICE:  table "event_log" does not exist, skipping
DROP TABLE
NOTICE:  table "job_logs" does not exist, skipping
DROP TABLE
NOTICE:  table "audit_events" does not exist, skipping
DROP TABLE
NOTICE:  table "object_refs" does not exist, skipping
DROP TABLE
NOTICE:  table "response_statuses" does not exist, skipping
DROP TABLE
NOTICE:  table "users_info" does not exist, skipping
DROP TABLE
#+end_example
* Exploring our first dataset

#+BEGIN_SRC sql-mode
select count(*) from audit_events;
#+END_SRC

#+RESULTS:
#+begin_src sql-mode
 count 
-------
     0
(1 row)

#+end_src

#+BEGIN_SRC sql-mode
\dt
#+END_SRC

#+RESULTS:
#+begin_src sql-mode
Did not find any relations.
#+end_src

#+BEGIN_SRC sql-mode
\dt audit_events

#+END_SRC

#+RESULTS:
#+begin_src sql-mode
           List of relations
 Schema |     Name     | Type  | Owner 
--------+--------------+-------+-------
 public | audit_events | table | hh
(1 row)

#+end_src

* Audit Events
** columns
*** audit_id
#+NAME: audit_id
#+BEGIN_SRC sql-mode
    audit_id uuid NOT NULL,
#+END_SRC

This is a UUID!
But there are multiple occurences in a single log file.

**** Examples
#+BEGIN_SRC json
  auditID: "c0793350-e7fe-42ce-93e6-8436a0eb3b39",
#+END_SRC
**** 285593 times each one occurs once
#+BEGIN_SRC shell
cat kube-apiserver-audit.log | jq .auditID | sort | uniq -c | grep -v '2 "' | wc -l
#+END_SRC
**** 8141 times a single uuid shows up twice
#+BEGIN_SRC shell
cat kube-apiserver-audit.log | jq .auditID | sort | uniq -c | grep -v '1 "' | wc -l
#+END_SRC
**** When a UUID shows up twice, the only diff is stage and stageTimestamp
#+BEGIN_SRC shell
 cat kube-apiserver-audit.log | jq -c '. | select( .auditID | contains("ffe9adb2-6917-49ed-b823-72c4fe4355e0"))' | jq 
#+END_SRC

  "stage": "ResponseStarted => ResponseComplete"
  "stageTimestamp": "2019-06-17T05:19:17.898138Z",

#+BEGIN_SRC shell
cat kube-apiserver-audit.log | jq .auditID | sort | uniq -c | grep -v '1 "' | wc -l
#+END_SRC

*** testrun_id
We need something to differentiate test run
#+NAME: testrun_id
#+BEGIN_SRC sql-mode
    testrun_id text,
#+END_SRC
*** op_id
#+NAME: op_id
#+BEGIN_SRC sql-mode
    op_id text,
#+END_SRC
*** stage
    "stage"
#+NAME: stage
#+BEGIN_SRC sql-mode
  stage text NOT NULL,
#+END_SRC
*** level
#+NAME: level
#+BEGIN_SRC sql-mode
  level text NOT NULL,
#+END_SRC

level: "Request", "Metadata", "RequestResponse"

I'm not sure here, but I feel like we should only be looking at RequestResponse... not all three.
Huh, that was wrong.. the counts differ wildly:

**** 171724 Requests
#+BEGIN_SRC shell
cat kube-apiserver-audit.log | jq -c '. | select( .level | contains("Request"))' | jq -r .auditID | sort | uniq | wc -l
#+END_SRC
**** 122010 Metadata
#+BEGIN_SRC shell
cat kube-apiserver-audit.log | jq -c '. | select( .level | contains("RequestResponse"))' | jq -r .auditID | sort | uniq | wc -l
#+END_SRC

**** 26016 RequestResponse
#+BEGIN_SRC shell
cat kube-apiserver-audit.log | jq -c '. | select( .level | contains("RequestResponse"))' | jq -r .auditID | sort | uniq | wc -l
#+END_SRC

*** verb
#+NAME: verb
#+BEGIN_SRC sql-mode
  verb text NOT NULL,
#+END_SRC
An http verb != endpoint verb:
stage has quite a few values
- create
- delete
- deletecollection,
- get
- list
- patch
- update
- watch
*** request_uri
#+NAME: request_uri
#+BEGIN_SRC sql-mode
  request_uri text NOT NULL,
#+END_SRC

We'll need to use this to match against the OpenAPISpec to find the endpoint.

request_uri: "/api/v1/namespaces/kube-system/pods/etcd-empty-dir-cleanup-bootstrap-e2e-master",
*** user_agent
#+NAME: user_agent
#+BEGIN_SRC sql-mode
  user_agent text,
#+END_SRC
For e2e.test we added support to append -- and the test name at that point it time:

userAgent: "kubelet/v1.16.0 (linux/amd64) kubernetes/0e499be",

It may make sense to split on '--' an store what follows as the testName.
*** test_name
#+NAME: test_name
#+BEGIN_SRC sql-mode
  test_name text,
#+END_SRC

This isn't a direct mapping, we create it if the userAgent contains '--' followed by the test name.
For now we only see this with e2e.test.
*** request_ts
    "requestReceivedTimestamp"
#+NAME: request_ts
#+BEGIN_SRC sql-mode
  request_ts timestamp with time zone,
#+END_SRC
*** stage_ts

Noting that when we have a responseComplete, it's always paid with a responseStarted.
The UUID and everything else is the same, other than the timestamp.
I suspect this is only generated for requests that take a while.

stage: "ResponseComplete", "ResponseStarted"
#+NAME: stage_ts
#+BEGIN_SRC sql-mode
  stage_ts timestamp with time zone,
#+END_SRC
*** Kind / apiVersion                                                :unused:

For every singe one the values are the same:
kind: "Event"
apiVersion: "audit.k8s.io/v1"

#+NAME: kind
#+BEGIN_SRC sql-mode
  kind text,
  "apiVersion" text,
#+END_SRC
*** annotations                                                      :unused:

This is a json blog... not sure how to handle yet
https://blog.hasura.io/postgres-json-and-jsonb-type-support-on-graphql-41f586e47536/

Unsure we need annotations for now as they may be good for understanding a
specific test, the data doesn't aggregate well.

#+BEGIN_SRC shell
cat kube-apiserver-audit.log | jq -r .annotations | sort | uniq
#+END_SRC

A good number of them seem to be allow or deny + reason:

#+BEGIN_SRC json
  "annotations": {
    "authorization.k8s.io/decision": "allow",
    "authorization.k8s.io/reason": ""
  }
#+END_SRC

#+BEGIN_SRC sql-mode
  annotations jsonb,
#+END_SRC
*** sourceIPs                                                        :unused:
#+BEGIN_SRC sql-mode
  "sourceIP" text,
#+END_SRC

Could likely identify pods in this way, but not useful at this time.
sourceIPs: ["1.1.1.1"],
*** Unused Fields                                                    :unused:
The id could probably be dropped in favor of UUID, if we only capture ResponseStarted.
#+BEGIN_SRC sql-mode
  -- I'm unsure what this is
  -- This is to point back to the job that created these logs
  job_log_id integer NOT NULL
  -- should it be an iteger?
  -- maybe get rid of it completely?
  id integer NOT NULL,
#+END_SRC

** table


#+BEGIN_SRC tmate
  cd ~/ii/apisnoop_v3
  python3 import_entries.py
#+END_SRC

#+NAME: CREATE TABLE audit_events
#+BEGIN_SRC sql-mode :noweb yes :tangle ../hasura/migrations/10_table_audit_events.up.sql
  CREATE TABLE public.audit_events (
    <<audit_id>>
    <<testrun_id>>
    <<op_id>>
    <<stage>>
    <<level>>
    <<verb>>
    <<request_uri>>
    <<user_agent>>
    <<test_name>>
    <<requestObject.kind>>
    <<requestObject.apiVersion>>
    <<requestObject.metadata>>
    <<requestObject.spec>>
    <<requestObject.status>>
    <<responseObject.kind>>
    <<responseObject.apiVersion>>
    <<responseObject.metadata>>
    <<responseObject.spec>>
    <<responseObject.status>>
    <<request_ts>>
    <<stage_ts>>
    CONSTRAINT audit_id_stage PRIMARY KEY (audit_id, stage)
  );
  -- Indexes
  create index audit_events_op_id on audit_events(op_id);
  create index audit_events_verb on audit_events(verb);
  create index audit_events_request_uri on audit_events(request_uri);
#+END_SRC

#+RESULTS: CREATE TABLE audit_events
#+begin_src sql-mode
ERROR:  syntax error at or near "with"
LINE 22:   stage_ts with time zone,
                    ^
#+end_src

#+NAME: DROP TABLE audit_events
#+BEGIN_SRC sql-mode :noweb yes :tangle ../hasura/migrations/10_table_audit_events.down.sql
  DROP TABLE IF EXISTS audit_events;
#+END_SRC

#+RESULTS: DROP TABLE audit_events
#+begin_src sql-mode
NOTICE:  table "audit_events" does not exist, skipping
DROP TABLE
#+end_src

#+NAME: track_table audit_events
#+BEGIN_SRC sql-mode :noweb yes :tangle ../hasura/migrations/20_track_audit_events.up.yaml
- type: track_table
  args:
    schema: public
    name: audit_events
#+END_SRC

#+NAME: untrack_table audit_events
#+BEGIN_SRC sql-mode :noweb yes :tangle ../hasura/migrations/20_track_audit_events.down.yaml
- type: untrack_table
  args:
    schema: public
    name: audit_events
#+END_SRC

After creating the table, we have to go to the console:
http://localhost:8080/console/data/schema/public
And click on [Track All] or [Track] for the table.

I also tracked the following in network traffic, but have yet to execute them
via a directy grahpql query.

#+BEGIN_SRC shell :directory ~/apisnoop_v3
hasura init --endpoint http://localhost:8080/v1/graphql
export HASURA_GRAPHQL_ADMIN_SECRET=X
# --admin-secret "X"
#+END_SRC

*** SQL VIEW for JSON BLOBS
This has one column... event which is a jsonb.

#+BEGIN_SRC sql-mode
CREATE OR REPLACE VIEW "public"."events" AS 
 SELECT audit_events.auditID AS uuid,
    audit_events.level AS level,
    audit_events.verb AS verb,
    audit_events.requestURI AS uri,
    audit_events.userAgent AS useragent,
    audit_events.testName AS testName,
    -- ((audit_events.event -> 'requestObject'::text) ->> 'apiVersion'::text) AS apiversion,
    ((audit_events.event -> 'requestObject'::text) ->> 'kind'::text) AS kind,
    ((audit_events.event -> 'requestObject'::text) ->> 'metadata'::text) AS metadata,
    ((audit_events.event -> 'requestObject'::text) ->> 'spec'::text) AS spec,
    ((audit_events.event -> 'requestObject'::text) ->> 'status'::text) AS requeststatus,
    ((audit_events.event -> 'responseObject'::text) ->> 'status'::text) AS status,
    ((audit_events.event -> 'responseObject'::text) ->> 'kind'::text) AS responsekind,
    ((audit_events.event -> 'responseObject'::text) ->> 'metadata'::text) AS responsemetadata,
    ((audit_events.event -> 'responseObject'::text) ->> 'spec'::text) AS responsespec
   FROM audit_events;
#+END_SRC

#+RESULTS:
#+begin_src sql-mode
ERROR:  column audit_events.event does not exist
LINE 2:  SELECT (audit_events.event -> 'auditID'::text) AS uuid,
                 ^
#+end_src

** sequence

#+BEGIN_SRC sql-mode
CREATE SEQUENCE public.audit_events_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;
ALTER SEQUENCE public.audit_events_id_seq OWNED BY public.audit_events.id;
#+END_SRC

#+RESULTS:
: CREATE SEQUENCE
: ALTER SEQUENCE
** constraints

#+BEGIN_SRC sql-mode
ALTER TABLE ONLY public.audit_events
    ADD CONSTRAINT "audit_events_auditID_key" UNIQUE ("auditID");
ALTER TABLE ONLY public.audit_events
    ADD CONSTRAINT audit_events_pkey PRIMARY KEY (id);
#+END_SRC

#+RESULTS:
: ALTER TABLE
: ALTER TABLE

* Prow Job Artifacts

#+BEGIN_SRC python
  prow_something="prow.k8s.io"
  gcs_logs="https://storage.googleapis.com/kubernetes-jenkins/logs/"
  buckets = [
      "ci-kubernetes-e2e-gce-cos-k8sbeta-default",
      "ci-kubernetes-e2e-gce-cos-k8sstable1-default",
      "ci-kubernetes-e2e-gce-cos-k8sstable2-default",
      "ci-kubernetes-e2e-gce-cos-k8sstable3-default",
      "ci-kubernetes-e2e-gci-gce"
  ]
  bucket="ci-kubernetes-e2e-gci-gce"
  testgrid_history_url = gcs_logs + bucket + "/jobResultsCache.json"
  # look for latest_success
#+END_SRC

** table
#+BEGIN_SRC sql-mode
CREATE TABLE public.audit_session (
    version text NOT NULL,
    passed text NOT NULL,
    result text NOT NULL,
    infra_commit text NOT NULL,
    id integer NOT NULL,
    "timestamp" integer NOT NULL
);
#+END_SRC

#+RESULTS:
: CREATE TABLE

** sequence
#+BEGIN_SRC sql-mode
CREATE SEQUENCE public.job_log_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;
ALTER TABLE ONLY public.job_logs
    ALTER COLUMN id SET DEFAULT nextval('public.job_log_id_seq'::regclass);
#+END_SRC

#+RESULTS:

** primary key

#+BEGIN_SRC sql-mode
ALTER TABLE ONLY public.job_logs
    ADD CONSTRAINT job_log_pkey PRIMARY KEY (id);
#+END_SRC

#+RESULTS:
: ALTER TABLE

** force each audit_event to point reference a job_log
#+NAME: audit_events => job_logs
#+BEGIN_SRC sql-mode
ALTER TABLE ONLY public.audit_events
    ADD CONSTRAINT audit_events_job_log_id_fkey
    FOREIGN KEY (job_log_id)
    REFERENCES public.job_logs(id)
    ON UPDATE RESTRICT ON DELETE RESTRICT;
#+END_SRC

#+RESULTS: audit_events => job_logs
: ALTER TABLE

* Audit Session
** table
#+BEGIN_SRC sql-mode
CREATE TABLE public.audit_session (
    version text NOT NULL,
    passed text NOT NULL,
    result text NOT NULL,
    infra_commit text NOT NULL,
    id integer NOT NULL,
    "timestamp" integer NOT NULL
);
#+END_SRC

#+RESULTS:
: CREATE TABLE

** sequence
#+BEGIN_SRC sql-mode
CREATE SEQUENCE public.job_log_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;
ALTER TABLE ONLY public.job_logs
    ALTER COLUMN id SET DEFAULT nextval('public.job_log_id_seq'::regclass);
#+END_SRC

#+RESULTS:

** primary key

#+BEGIN_SRC sql-mode
ALTER TABLE ONLY public.job_logs
    ADD CONSTRAINT job_log_pkey PRIMARY KEY (id);
#+END_SRC

#+RESULTS:
: ALTER TABLE

** force each audit_event to point reference a job_log
#+NAME: audit_events => job_logs
#+BEGIN_SRC sql-mode
ALTER TABLE ONLY public.audit_events
    ADD CONSTRAINT audit_events_job_log_id_fkey
    FOREIGN KEY (job_log_id)
    REFERENCES public.job_logs(id)
    ON UPDATE RESTRICT ON DELETE RESTRICT;
#+END_SRC

#+RESULTS: audit_events => job_logs
: ALTER TABLE

* Job Logs
** table
#+BEGIN_SRC sql-mode
CREATE TABLE public.job_logs (
    version text NOT NULL,
    id integer NOT NULL,
    result text NOT NULL,
    passed text NOT NULL,
    job_version text NOT NULL,
    node_os_image text NOT NULL,
    infra_commit text NOT NULL,
    master_os_image text NOT NULL,
    pod text NOT NULL,
    revision text NOT NULL,
    "timestamp" integer NOT NULL
);
#+END_SRC

#+RESULTS:
: CREATE TABLE

** sequence
#+BEGIN_SRC sql-mode
CREATE SEQUENCE public.job_log_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;
ALTER TABLE ONLY public.job_logs
    ALTER COLUMN id SET DEFAULT nextval('public.job_log_id_seq'::regclass);
#+END_SRC

#+RESULTS:

** primary key

#+BEGIN_SRC sql-mode
ALTER TABLE ONLY public.job_logs
    ADD CONSTRAINT job_log_pkey PRIMARY KEY (id);
#+END_SRC

#+RESULTS:
: ALTER TABLE

** force each audit_event to point reference a job_log
#+NAME: audit_events => job_logs
#+BEGIN_SRC sql-mode
ALTER TABLE ONLY public.audit_events
    ADD CONSTRAINT audit_events_job_log_id_fkey
    FOREIGN KEY (job_log_id)
    REFERENCES public.job_logs(id)
    ON UPDATE RESTRICT ON DELETE RESTRICT;
#+END_SRC

#+RESULTS: audit_events => job_logs
: ALTER TABLE

* Object References
After looking at what is actually in the object references, I'm not sure it's
worth loading at this time.
** Example

#+BEGIN_SRC shell
cat kube-apiserver-audit.log | jq -c '. | select( .auditID | contains("65700178-2fb7-4ed9-a589-fd78ea9db2ae"))' | jq .
#+END_SRC

#+BEGIN_SRC json
  "objectRef": {
    "resource": "subjectaccessreviews",
    "apiGroup": "authorization.k8s.io",
    "apiVersion": "v1"
  },
#+END_SRC

** Data Set Inspection
*** apiGroup
 #+BEGIN_EXAMPLE
 admissionregistration.k8s.io
 apiextensions.k8s.io
 apiregistration.k8s.io
 apps
 authentication.k8s.io
 authorization.k8s.io
 autoscaling
 batch
 certificates.k8s.io
 coordination.k8s.io
 crd-publish-openapi-test-common-group.k8s.io
 crd-publish-openapi-test-empty.k8s.io
 crd-publish-openapi-test-foo.k8s.io
 crd-publish-openapi-test-multi-to-single-ver.k8s.io
 crd-publish-openapi-test-multi-ver.k8s.io
 crd-publish-openapi-test-waldo.k8s.io
 discovery-crd-test.k8s.io
 events.k8s.io
 extensions
 kubectl-crd-test.k8s.io
 metrics.k8s.io
 mygroup.example.com
 networking.k8s.io
 node.k8s.io
 null
 policy
 rbac.authorization.k8s.io
 resourcequota-crd-test.k8s.io
 scalingpolicy.kope.io
 scheduling.k8s.io
 settings.k8s.io
 snapshot.storage.k8s.io
 stable.example.com
 storage.k8s.io
 wardle.k8s.io
 webhook-crd-test.k8s.io
 webhook-multiversion-crd-test.k8s.io
 #+END_EXAMPLE

*** apiVersion
 #+BEGIN_EXAMPLE
 null
 v1
 v1alpha1
 v1beta1
 v2
 v2alpha1
 v3
 v4
 v5
 v6
 #+END_EXAMPLE

*** resource
 #+BEGIN_EXAMPLE
 apiservices
 certificatesigningrequests
 clusterrolebindings
 clusterroles
 componentstatuses
 configmaps
 controllerrevisions
 cronjobs
 csidrivers
 csinodes
 customresourcedefinitions
 daemonsets
 deployments
 e2e-test-crd-publish-openapi-1705-crds
 e2e-test-crd-publish-openapi-2576-crds
 e2e-test-crd-publish-openapi-3791-crds
 e2e-test-crd-publish-openapi-3893-crds
 e2e-test-crd-publish-openapi-4783-crds
 e2e-test-crd-publish-openapi-5430-crds
 e2e-test-crd-publish-openapi-9211-crds
 e2e-test-crd-publish-openapi-9322-crds
 e2e-test-crd-publish-openapi-9371-crds
 e2e-test-crd-publish-openapi-9757-crds
 e2e-test-crd-publish-openapi-9845-crds
 e2e-test-crd-webhook-1243-crds
 e2e-test-crd-webhook-4913-crds
 e2e-test-discovery-422-crds
 e2e-test-kubectl-2997-crds
 e2e-test-kubectl-6759-crds
 e2e-test-kubectl-8022-crds
 e2e-test-resourcequota-7776-crds
 e2e-test-webhook-5821-crds
 e2e-test-webhook-5890-crds
 e2e-test-webhook-7340-crds
 e2e-test-webhook-9447-crds
 endpoints
 events
 flunders
 foo9n5qhas
 fookfwthas
 foox9nb8as
 horizontalpodautoscalers
 ingresses
 jobs
 leases
 limitranges
 mutatingwebhookconfigurations
 namespaces
 networkpolicies
 nodes
 noxus
 null
 persistentvolumeclaims
 persistentvolumes
 poddisruptionbudgets
 podpresets
 pods
 podsecuritypolicies
 podtemplates
 priorityclasses
 replicasets
 replicationcontrollers
 resourcequotas
 rolebindings
 roles
 runtimeclasses
 scalingpolicies
 secrets
 selfsubjectaccessreviews
 serviceaccounts
 services
 statefulsets
 storageclasses
 subjectaccessreviews
 tokenreviews
 validatingwebhookconfigurations
 volumeattachments
 volumesnapshotclasses
 volumesnapshotcontents
 volumesnapshots
 #+END_EXAMPLE

*** subresource
 #+BEGIN_EXAMPLE
 approval
 attach
 binding
 eviction
 exec
 finalize
 log
 null
 portforward
 proxy
 rollback
 scale
 status
 token
 #+END_EXAMPLE

** table
#+BEGIN_SRC sql-mode
CREATE TABLE public.object_refs (
    id integer NOT NULL,
    audit_event_id integer NOT NULL,
    resource text,
    namespace text,
    name text,
    "apiVersion" text,
    "apiGroup" text
);
#+END_SRC

#+RESULTS:
: CREATE TABLE

** sequence
#+BEGIN_SRC sql-mode
CREATE SEQUENCE public.object_refs_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;
ALTER SEQUENCE public.object_refs_id_seq
    OWNED BY public.object_refs.id;
ALTER TABLE ONLY public.object_refs
    ALTER COLUMN id SET DEFAULT nextval('public.object_refs_id_seq'::regclass);
#+END_SRC

#+RESULTS:
: CREATE SEQUENCE
: ALTER SEQUENCE
: ALTER TABLE

** keys
#+BEGIN_SRC sql-mode
ALTER TABLE ONLY public.object_refs
    ADD CONSTRAINT object_refs_pkey PRIMARY KEY (id);
ALTER TABLE ONLY public.object_refs
    ADD CONSTRAINT object_refs_audit_event_id_fkey
    FOREIGN KEY (audit_event_id)
    REFERENCES public.audit_events(id)
    ON UPDATE RESTRICT ON DELETE RESTRICT;
#+END_SRC

#+RESULTS:
: ALTER TABLE

* requestObjects
** columns
*** requestkind
#+NAME: requestObject.kind
#+BEGIN_SRC sql-mode
    requestkind text NOT NULL,
#+END_SRC

**** Examples
#+BEGIN_SRC json
"requestObject": {
    "kind": "SubjectAccessReview",
#+END_SRC

#+BEGIN_SRC shell
cat kube-apiserver-audit.log | jq  -r .requestObject.kind | sort | uniq > kinds.txt
cat kube-apiserver-audit.log | jq  -r .responseObject.kind | sort | uniq > rkinds.txt
diff kinds.txt rkinds.txt
#+END_SRC

Only requestObjects include Binding, DeleteOptions, and DeploymentRollback
Only responsesObjects include Status and TokenRequest

#+BEGIN_SRC diff
2d1
< Binding
12d10
< DeleteOptions
14d11
< DeploymentRollback
39a37
> Status
41a40
> TokenRequest
#+END_SRC

*** requestapiversion
#+NAME: requestObject.apiVersion
#+BEGIN_SRC sql-mode
  requestapiversion text NOT NULL,
#+END_SRC
Might be tied to level = request, response etc
**** examples
#+BEGIN_SRC json
"requestObject": {
    "apiVersion": "authorization.k8s.io/v1",
#+END_SRC

I'm not sure here, but I feel like we should only be looking at RequestResponse... not all three.
Huh, that was wrong.. the counts differ wildly:

*** requestmeta
#+NAME: requestObject.metadata
#+BEGIN_SRC sql-mode
  requestmeta jsonb NOT NULL,
#+END_SRC
**** examples
#+BEGIN_SRC json
"requestObject": {
    "metadata": {
      "creationTimestamp": null
    },
#+END_SRC
*** requestspec
#+NAME: requestObject.spec
#+BEGIN_SRC sql-mode
  requestspec jsonb NOT NULL,
#+END_SRC
**** examples
#+BEGIN_SRC json
"requestObject": {
    "spec": {
      "resourceAttributes": {
        "namespace": "kubernetes-dashboard-6069",
        "verb": "use",
        "group": "extensions",
        "resource": "podsecuritypolicies",
        "name": "e2e-test-privileged-psp"
      },
      "user": "system:serviceaccount:kubernetes-dashboard-6069:default"
    },
#+END_SRC
*** requeststatus
#+NAME: requestObject.status
#+BEGIN_SRC sql-mode
  requeststatus jsonb NOT NULL,
#+END_SRC
**** examples
#+BEGIN_SRC json
  "responseObject": {
    "status": {
      "allowed": true,
      "reason": "RBAC: allowed by RoleBinding \"kubernetes-dashboard-6069--e2e-test-privileged-psp/kubernetes-dashboard-6069\" of ClusterRole \"e2e-test-privileged-psp\" to ServiceAccount \"default/kubernetes-dashboard-6069\""
    }
#+END_SRC

** table

We'll just load these as jsonb into the main audit_events table.

From https://kubernetes.io/docs/reference/generated/kubernetes-api/v1.15/

#+BEGIN_EXAMPLE
Resource objects typically have 3 components:

Resource ObjectMeta: This is metadata about the resource, such as its name, type, api version, annotations, and labels. This contains fields that maybe updated both by the end user and the system (e.g. annotations).

ResourceSpec: This is defined by the user and describes the desired state of system. Fill this in when creating or updating an object.

ResourceStatus: This is filled in by the server and reports the current state of the system. In most cases, users don't need to change this.
#+END_EXAMPLE



These have more information
#+BEGIN_SRC json
"requestObject": {
    "kind": "SubjectAccessReview",
    "apiVersion": "authorization.k8s.io/v1",
    "metadata": {
      "creationTimestamp": null
    },
    "spec": {
      "resourceAttributes": {
        "namespace": "kubernetes-dashboard-6069",
        "verb": "use",
        "group": "extensions",
        "resource": "podsecuritypolicies",
        "name": "e2e-test-privileged-psp"
      },
      "user": "system:serviceaccount:kubernetes-dashboard-6069:default"
    },
    "status": {
      "allowed": false
    }
  },
#+END_SRC

* responseObjects
** columns
*** responsekind
#+NAME: responseObject.kind
#+BEGIN_SRC sql-mode
    responsekind text NOT NULL,
#+END_SRC

**** Examples
#+BEGIN_SRC json
"responseObject": {
    "kind": "SubjectAccessReview",
#+END_SRC

#+BEGIN_SRC shell
cat kube-apiserver-audit.log | jq  -r .responseObject.kind | sort | uniq > kinds.txt
cat kube-apiserver-audit.log | jq  -r .responseObject.kind | sort | uniq > rkinds.txt
diff kinds.txt rkinds.txt
#+END_SRC

Only responseObjects include Binding, DeleteOptions, and DeploymentRollback
Only responsesObjects include Status and TokenResponse

#+BEGIN_SRC diff
2d1
< Binding
12d10
< DeleteOptions
14d11
< DeploymentRollback
39a37
> Status
41a40
> TokenResponse
#+END_SRC

*** responseapiversion
#+NAME: responseObject.apiVersion
#+BEGIN_SRC sql-mode
  responseapiversion text NOT NULL,
#+END_SRC
Might be tied to level = response, response etc
**** examples
#+BEGIN_SRC json
"responseObject": {
    "apiVersion": "authorization.k8s.io/v1",
#+END_SRC

I'm not sure here, but I feel like we should only be looking at ResponseResponse... not all three.
Huh, that was wrong.. the counts differ wildly:

*** responsemeta
#+NAME: responseObject.metadata
#+BEGIN_SRC sql-mode
  responsemeta jsonb NOT NULL,
#+END_SRC
**** examples
#+BEGIN_SRC json
"responseObject": {
    "metadata": {
      "creationTimestamp": null
    },
#+END_SRC
*** responsespec
#+NAME: responseObject.spec
#+BEGIN_SRC sql-mode
  responsespec jsonb NOT NULL,
#+END_SRC
**** examples
#+BEGIN_SRC json
"responseObject": {
    "spec": {
      "resourceAttributes": {
        "namespace": "kubernetes-dashboard-6069",
        "verb": "use",
        "group": "extensions",
        "resource": "podsecuritypolicies",
        "name": "e2e-test-privileged-psp"
      },
      "user": "system:serviceaccount:kubernetes-dashboard-6069:default"
    },
#+END_SRC
*** responsestatus
#+NAME: responseObject.status
#+BEGIN_SRC sql-mode
  responsestatus jsonb NOT NULL,
#+END_SRC
**** examples
#+BEGIN_SRC json
  "responseObject": {
    "status": {
      "allowed": true,
      "reason": "RBAC: allowed by RoleBinding \"kubernetes-dashboard-6069--e2e-test-privileged-psp/kubernetes-dashboard-6069\" of ClusterRole \"e2e-test-privileged-psp\" to ServiceAccount \"default/kubernetes-dashboard-6069\""
    }
#+END_SRC

** Notes
#+BEGIN_SRC json
  "responseObject": {
    "kind": "SubjectAccessReview",
    "apiVersion": "authorization.k8s.io/v1",
    "metadata": {
      "creationTimestamp": null
    },
    "spec": {
      "resourceAttributes": {
        "namespace": "kubernetes-dashboard-6069",
        "verb": "use",
        "group": "extensions",
        "resource": "podsecuritypolicies",
        "name": "e2e-test-privileged-psp"
      },
      "user": "system:serviceaccount:kubernetes-dashboard-6069:default"
    },
    "status": {
      "allowed": true,
      "reason": "RBAC: allowed by RoleBinding \"kubernetes-dashboard-6069--e2e-test-privileged-psp/kubernetes-dashboard-6069\" of ClusterRole \"e2e-test-privileged-psp\" to ServiceAccount \"default/kubernetes-dashboard-6069\""
    }
  },
#+END_SRC

* Response Statuses
Not useful for analytics
** Data Set Inspection
#+BEGIN_SRC json
{
  "metadata": {},
  "status": "Failure",
  "reason": "Forbidden",
  "code": 403
}
{
  "metadata": {},
  "code": 200
}
{
  "metadata": {},
  "code": 201
}
{
  "metadata": {},
  "status": "Failure",
  "reason": "NotFound",
  "code": 404
}
#+END_SRC

** table
#+BEGIN_SRC sql-mode
CREATE TABLE public.response_statuses (
    metadata json NOT NULL,
    status text,
    reason text,
    id integer NOT NULL,
    audit_event_id integer NOT NULL,
    code integer
);
#+END_SRC

#+RESULTS:
: CREATE TABLE

** sequences

#+BEGIN_SRC sql-mode
CREATE SEQUENCE public.response_statuses_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;

ALTER SEQUENCE public.response_statuses_id_seq
    OWNED BY public.response_statuses.id;
ALTER TABLE ONLY public.response_statuses
    ALTER COLUMN id SET DEFAULT nextval('public.response_statuses_id_seq'::regclass);
#+END_SRC

#+RESULTS:
: CREATE SEQUENCE
: ALTER SEQUENCE

** keys

#+BEGIN_SRC sql-mode
ALTER TABLE ONLY public.response_statuses
    ADD CONSTRAINT response_statuses_pkey PRIMARY KEY (id);
ALTER TABLE ONLY public.response_statuses
    ADD CONSTRAINT response_statuses_audit_event_id_fkey
    FOREIGN KEY (audit_event_id)
    REFERENCES public.audit_events(id)
    ON UPDATE RESTRICT ON DELETE RESTRICT;
#+END_SRC

#+RESULTS:
: ALTER TABLE

* Users

Not sure we need this at this time:

#+BEGIN_SRC shell :eval never
cat kube-apiserver-audit.log | jq -r .user | sort | uniq
#+END_SRC


** table
#+BEGIN_SRC sql-mode
CREATE TABLE public.users_info (
    id integer NOT NULL,
    username text NOT NULL,
    groups json NOT NULL,
    audit_event_id integer NOT NULL
);
#+END_SRC

#+RESULTS:
: CREATE TABLE

** sequence

#+BEGIN_SRC sql-mode
CREATE SEQUENCE public.user_info_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;
ALTER SEQUENCE public.user_info_id_seq OWNED BY public.users_info.id;
ALTER TABLE ONLY public.users_info
    ALTER COLUMN id SET DEFAULT nextval('public.user_info_id_seq'::regclass);
#+END_SRC

#+RESULTS:
: CREATE SEQUENCE
: ALTER SEQUENCE
: ALTER TABLE

** keys

#+BEGIN_SRC sql-mode
ALTER TABLE ONLY public.users_info ADD
    CONSTRAINT user_info_pkey PRIMARY KEY (id);
ALTER TABLE ONLY public.users_info ADD
    CONSTRAINT user_info_audit_event_id_fkey
    FOREIGN KEY (audit_event_id)
    REFERENCES public.audit_events(id)
    ON UPDATE RESTRICT ON DELETE RESTRICT;
#+END_SRC

#+RESULTS:
: ALTER TABLE

* Irregularities
** Why do we have 4 of these often enough?

#+BEGIN_SRC sql-mode
select audit_id, count(*) as cnt from audit_events group by audit_id order by cnt desc limit 10;
#+END_SRC

#+RESULTS:
#+begin_src sql-mode
               audit_id               | cnt 
--------------------------------------+-----
 246a72a6-def7-4551-b030-e41ffc99333f |   2
 2b7758ec-1edf-416f-ac51-54a087c34ab3 |   2
 ed15f32e-b38b-4653-a217-c31eed174275 |   2
 a932ab52-2d13-4657-b935-a377bc814f61 |   2
 ed1bedef-b5a7-43ed-b43f-cf75c85dfcb4 |   2
 348e6f6a-dd41-4fe9-8592-242a48fbeacc |   2
 b810fd25-3ea1-4ad9-bff7-cddc672e1784 |   2
 f61771d1-5c0f-49fe-bc31-824342673701 |   2
 90854efc-c99c-48ec-8b75-87bb86ea7e0c |   2
 4c32505e-6e82-46c3-8c20-1487091bccee |   2
(10 rows)

#+end_src

#+BEGIN_SRC sql-mode
select count(audit_id), count(distinct audit_id) from audit_events ;
#+END_SRC

#+RESULTS:
#+begin_src sql-mode
 count | count 
-------+-------
 24939 | 24596
(1 row)

#+end_src

#+BEGIN_SRC sql-mode
select audit_id, testrun_id, op_id, stage, level, verb, request_uri, user_agent, test_name, requestkind, requestapiversion, requestmeta, requestspec, requeststatus, responsekind, responseapiversion, responsemeta, responsespec, responsestatus, request_ts, stage_ts from audit_events where audit_id = '003bd7aa-0e61-46a3-9920-fef0abd2f08e';
#+END_SRC

#+BEGIN_SRC sql-mode
select * from audit_events limit 10;
#+END_SRC

#+RESULTS:
#+begin_src sql-mode
               audit_id               |     testrun_id      | op_id |      stage       |      level      |  verb  |                                             request_uri                                             |                                     user_agent                                     |                                                                  test_name                                                                   |  requestkind  |      requestapiversion       |                                 requestmeta                                  | requestspec | requeststatus | responsekind |      responseapiversion      |                                                                                                                                                            responsemeta                                                                                                                                                             | responsespec | responsestatus |          request_ts           |           stage_ts            
--------------------------------------+---------------------+-------+------------------+-----------------+--------+-----------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------+----------------------------------------------------------------------------------------------------------------------------------------------+---------------+------------------------------+------------------------------------------------------------------------------+-------------+---------------+--------------+------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------+----------------+-------------------------------+-------------------------------
 b288774c-b9ef-45e1-9734-5b7d4063e89c | 1145963446211186694 |       | ResponseComplete | Request         | watch  | /api/v1/namespaces/secrets-4749/serviceaccounts?fieldSelector=metadata.name%3Ddefault&watch=true    | e2e.test/v1.16.0 (linux/amd64) kubernetes/6d8dd21                                  |  [sig-storage] Secrets should be consumable from pods in volume [NodeConformance] [Conformance]                                              |               |                              | {}                                                                           | {}          | {}            |              |                              | {}                                                                                                                                                                                                                                                                                                                                  | {}           | {}             | 2019-07-02 08:15:24.892146+00 | 2019-07-02 08:15:25.017966+00
 88ba569e-f36e-485a-992f-7d8c4f335700 | 1145963446211186694 |       | ResponseComplete | Request         | get    | /api/v1/namespaces/services-3305/pods/pod1                                                          | e2e.test/v1.16.0 (linux/amd64) kubernetes/6d8dd21                                  |  [sig-network] Services should serve multiport endpoints from pods  [Conformance]                                                            |               |                              | {}                                                                           | {}          | {}            |              |                              | {}                                                                                                                                                                                                                                                                                                                                  | {}           | {}             | 2019-07-02 08:15:25.025211+00 | 2019-07-02 08:15:25.0332+00
 c905a51a-a913-4b2d-a951-3af01356fb99 | 1145963446211186694 |       | ResponseComplete | RequestResponse | create | /apis/rbac.authorization.k8s.io/v1/namespaces/secrets-4749/rolebindings                             | e2e.test/v1.16.0 (linux/amd64) kubernetes/6d8dd21                                  |  [sig-storage] Secrets should be consumable from pods in volume [NodeConformance] [Conformance]                                              | RoleBinding   | rbac.authorization.k8s.io/v1 | {"name": "secrets-4749--e2e-test-privileged-psp", "creationTimestamp": null} | {}          | {}            | RoleBinding  | rbac.authorization.k8s.io/v1 | {"uid": "6d8e2889-8bfc-485f-8138-b6c39c89f17a", "name": "secrets-4749--e2e-test-privileged-psp", "selfLink": "/apis/rbac.authorization.k8s.io/v1/namespaces/secrets-4749/rolebindings/secrets-4749--e2e-test-privileged-psp", "namespace": "secrets-4749", "resourceVersion": "31380", "creationTimestamp": "2019-07-02T08:15:25Z"} | {}           | {}             | 2019-07-02 08:15:25.018398+00 | 2019-07-02 08:15:25.033843+00
 4fd0dca8-c237-4990-b6d6-83c94b811285 | 1145963446211186694 |       | ResponseComplete | Metadata        | list   | /apis/webhook-crd-test.k8s.io/v1/e2e-test-webhook-7018-crds?limit=500&resourceVersion=0             | kube-controller-manager/v1.16.0 (linux/amd64) kubernetes/6d8dd21/dynamic-informers |                                                                                                                                              |               |                              | {}                                                                           | {}          | {}            |              |                              | {}                                                                                                                                                                                                                                                                                                                                  | {}           | {}             | 2019-07-02 08:15:25.042029+00 | 2019-07-02 08:15:25.042198+00
 044b88ba-1134-4042-b18f-d96187885ad7 | 1145963446211186694 |       | ResponseComplete | Metadata        | list   | /apis/mygroup.example.com/v1beta1/noxus?limit=500&resourceVersion=0                                 | kube-controller-manager/v1.16.0 (linux/amd64) kubernetes/6d8dd21/dynamic-informers |                                                                                                                                              |               |                              | {}                                                                           | {}          | {}            |              |                              | {}                                                                                                                                                                                                                                                                                                                                  | {}           | {}             | 2019-07-02 08:15:25.046121+00 | 2019-07-02 08:15:25.046217+00
 6a2a1956-6578-4e0b-b49f-ce8ef12950fd | 1145963446211186694 |       | ResponseComplete | RequestResponse | delete | /apis/rbac.authorization.k8s.io/v1/clusterrolebindings/csi-snapshotter-role-provisioning-5507       | e2e.test/v1.16.0 (linux/amd64) kubernetes/6d8dd21                                  |  [sig-storage] CSI Volumes [Driver: csi-hostpath] [Testpattern: Dynamic PV (default fs)] provisioning should provision storage with defaults | DeleteOptions | rbac.authorization.k8s.io/v1 | {}                                                                           | {}          | {}            | Status       | v1                           | {}                                                                                                                                                                                                                                                                                                                                  | {}           | "Success"      | 2019-07-02 08:15:25.027508+00 | 2019-07-02 08:15:25.062197+00
 832396cd-a950-4f9e-a3c3-9960f77ab8a0 | 1145963446211186694 |       | ResponseComplete | Request         | get    | /api/v1/namespaces/var-expansion-9551/pods/var-expansion-cb147024-789b-4aec-8eb3-fccceea55963       | kubelet/v1.16.0 (linux/amd64) kubernetes/6d8dd21                                   |                                                                                                                                              |               |                              | {}                                                                           | {}          | {}            |              |                              | {}                                                                                                                                                                                                                                                                                                                                  | {}           | {}             | 2019-07-02 08:15:25.0524+00   | 2019-07-02 08:15:25.069223+00
 0524e68f-61ed-44be-944f-e3d573527cda | 1145963446211186694 |       | ResponseComplete | Request         | get    | /api/v1/namespaces/services-3305/pods/pod2                                                          | e2e.test/v1.16.0 (linux/amd64) kubernetes/6d8dd21                                  |  [sig-network] Services should serve multiport endpoints from pods  [Conformance]                                                            |               |                              | {}                                                                           | {}          | {}            |              |                              | {}                                                                                                                                                                                                                                                                                                                                  | {}           | {}             | 2019-07-02 08:15:25.073789+00 | 2019-07-02 08:15:25.07914+00
 8d09e772-001c-478d-8d52-6651cd88a285 | 1145963446211186694 |       | ResponseComplete | Metadata        | list   | /apis/kubectl-crd-test.k8s.io/v1/e2e-test-kubectl-4151-crds?limit=500&resourceVersion=0             | kube-controller-manager/v1.16.0 (linux/amd64) kubernetes/6d8dd21/dynamic-informers |                                                                                                                                              |               |                              | {}                                                                           | {}          | {}            |              |                              | {}                                                                                                                                                                                                                                                                                                                                  | {}           | {}             | 2019-07-02 08:15:25.100643+00 | 2019-07-02 08:15:25.100752+00
 23f1a629-5a0d-4fc3-9434-565a288451bb | 1145963446211186694 |       | ResponseComplete | Metadata        | list   | /apis/resourcequota-crd-test.k8s.io/v1/e2e-test-resourcequota-3989-crds?limit=500&resourceVersion=0 | kube-controller-manager/v1.16.0 (linux/amd64) kubernetes/6d8dd21/dynamic-informers |                                                                                                                                              |               |                              | {}                                                                           | {}          | {}            |              |                              | {}                                                                                                                                                                                                                                                                                                                                  | {}           | {}             | 2019-07-02 08:15:25.102501+00 | 2019-07-02 08:15:25.102604+00
(10 rows)

#+end_src

#+BEGIN_SRC sql-mode
select   
         audit_id, verb, stage, "level", request_uri, count(*)
as cnt from audit_events
group by audit_id, verb, stage, "level", request_uri order by cnt desc limit 40;
#+END_SRC

#+RESULTS:
#+begin_src sql-mode
               audit_id               |       verb       |      stage       |      level      |                                                                             request_uri                                                                              | cnt 
--------------------------------------+------------------+------------------+-----------------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------+-----
 460dae07-9d66-4772-9bc6-b92a81dbbdcd | deletecollection | ResponseComplete | Request         | /apis/apps/v1/namespaces/gc-579/deployments                                                                                                                          |   1
 f4840c73-d7b3-43bf-bc67-b2b8b8a6c9f1 | get              | ResponseComplete | Request         | /apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubelet-cluster-admin                                                                                         |   1
 cf86f1ee-a406-4410-93db-0b61f407371c | list             | ResponseComplete | Metadata        | /apis/snapshot.storage.k8s.io/v1alpha1/namespaces/projected-8953/volumesnapshots                                                                                     |   1
 6410ab45-4576-48cc-a26f-1c3a46adb64e | get              | ResponseComplete | Metadata        | /api/v1?timeout=32s                                                                                                                                                  |   1
 c4a3b706-27a0-42e8-912e-633ef78b3fe7 | delete           | ResponseComplete | RequestResponse | /apis/apps/v1/namespaces/provisioning-8800/statefulsets/csi-hostpath-attacher                                                                                        |   1
 94cbdb7e-bbc0-4784-80f4-0df70676ac3a | delete           | ResponseComplete | RequestResponse | /api/v1/namespaces/svc-latency-960/endpoints/latency-svc-vrxc9                                                                                                       |   1
 3a4a77b2-63f0-428e-aa74-8deca1768997 | list             | ResponseComplete | Metadata        | /apis/scalingpolicy.kope.io/v1alpha1/namespaces/hostpath-2322/scalingpolicies                                                                                        |   1
 e375dca0-ff72-4c60-ab7b-ae7d7c37a27b | update           | ResponseComplete | RequestResponse | /api/v1/persistentvolumes/pvc-923df833-9294-4344-a8eb-552deb390d69/status                                                                                            |   1
 731c788e-350f-42d6-97f6-4ffdb86b0eeb | list             | ResponseComplete | Request         | /apis/extensions/v1beta1/namespaces/kube-system/ingresses?labelSelector=kubernetes.io%2Fcluster-service%3Dtrue%2Caddonmanager.kubernetes.io%2Fmode%21%3DEnsureExists |   1
 06c78ca9-9ccf-4998-bf59-5694f976c712 | list             | ResponseComplete | Request         | /apis/networking.k8s.io/v1beta1/namespaces/disruption-5326/ingresses                                                                                                 |   1
 c73245ca-1294-4f76-b96a-56ee8c87de8b | get              | ResponseComplete | Metadata        | /apis/admissionregistration.k8s.io/v1beta1?timeout=32s                                                                                                               |   1
 3a88f87c-8d5f-4180-a79e-059124edad86 | get              | ResponseComplete | Metadata        | /apis/apps/v1?timeout=32s                                                                                                                                            |   1
 9a060663-9029-4174-801c-12801667f1e1 | list             | ResponseComplete | Metadata        | /apis/mygroup.example.com/v1beta1/fooqtrrtas?limit=500&resourceVersion=0                                                                                             |   1
 34f28e53-6293-4404-836b-ff02c26e63c4 | list             | ResponseComplete | Request         | /apis/extensions/v1beta1/namespaces/services-253/ingresses                                                                                                           |   1
 9c849d83-33aa-46ec-aa91-dacd85688fb7 | list             | ResponseComplete | Request         | /apis/apps/v1/namespaces/provisioning-5507/deployments                                                                                                               |   1
 7c7c33b3-b9db-43be-ae7c-9eba4c58420e | deletecollection | ResponseComplete | Request         | /apis/apps/v1/namespaces/hostpath-6672/replicasets                                                                                                                   |   1
 e4e63de8-bb24-4737-946b-ec425bbaa50c | list             | ResponseComplete | Metadata        | /apis/crd-publish-openapi-test-common-group.k8s.io/v4/e2e-test-crd-publish-openapi-4866-crds?limit=500&resourceVersion=0                                             |   1
 9d25b3e4-bf0b-415f-a320-a881deaa73b3 | list             | ResponseComplete | Request         | /api/v1/namespaces/persistent-local-volumes-test-5364/pods                                                                                                           |   1
 59f035cc-7dfc-4889-b3ab-558749f0009b | list             | ResponseComplete | Request         | /apis/apps/v1/namespaces/disruption-5326/deployments                                                                                                                 |   1
 f79d800c-b0bc-488b-939a-88e497707cd1 | get              | ResponseComplete | Metadata        | /apis/node.k8s.io/v1beta1?timeout=32s                                                                                                                                |   1
 1fec2a6f-5ff9-43f2-a8ab-1797a948303d | delete           | ResponseComplete | RequestResponse | /apis/rbac.authorization.k8s.io/v1/clusterrolebindings/psp-csi-hostpath-role-provisioning-8800                                                                       |   1
 e6ea761d-8ba4-4ca3-8994-ab94b6dc3964 | list             | ResponseComplete | Metadata        | /apis/resourcequota-crd-test.k8s.io/v1/e2e-test-resourcequota-3989-crds?limit=500&resourceVersion=0                                                                  |   1
 e2570456-456e-4a00-a6b8-daa186a1e7e3 | get              | ResponseComplete | Metadata        | /apis/batch/v1beta1?timeout=32s                                                                                                                                      |   1
 344f6edf-e994-4b3a-aee1-2e3d4e65b191 | deletecollection | ResponseComplete | Request         | /api/v1/namespaces/pods-3088/endpoints                                                                                                                               |   1
 2e143fa9-255a-46b5-b9d9-7daff718010b | get              | ResponseComplete | Metadata        | /apis/scheduling.k8s.io/v1?timeout=32s                                                                                                                               |   1
 49548ba8-f22a-4519-a4a8-2a7a645d3457 | list             | ResponseComplete | Request         | /api/v1/namespaces/provisioning-5507/persistentvolumeclaims                                                                                                          |   1
 d8f5d8b0-7e5a-48b7-ae87-45da9686bb94 | deletecollection | ResponseComplete | Request         | /apis/apps/v1/namespaces/crd-publish-openapi-2215/statefulsets                                                                                                       |   1
 17a9bac1-2118-477a-8703-2b69289458ab | get              | ResponseComplete | Metadata        | /api?timeout=32s                                                                                                                                                     |   1
 5241f037-0e90-44e5-ac89-b0628c7ac18a | get              | ResponseComplete | Metadata        | /apis/scalingpolicy.kope.io/v1alpha1?timeout=32s                                                                                                                     |   1
 deadf691-c787-4fa6-a27e-43c05073b45c | deletecollection | ResponseComplete | Request         | /apis/batch/v1/namespaces/volume-placement-3974/jobs                                                                                                                 |   1
 c42ec51e-f95c-4a1c-bc97-aa71c951b9ce | get              | ResponseComplete | Metadata        | /apis/scheduling.k8s.io/v1?timeout=32s                                                                                                                               |   1
 2b026bcd-1716-4ffc-b0fa-0be6a8b91ee1 | get              | ResponseComplete | Metadata        | /apis/autoscaling/v2beta1?timeout=32s                                                                                                                                |   1
 acea05f3-47f4-408e-b9ef-73f6707c09ba | deletecollection | ResponseComplete | Request         | /apis/events.k8s.io/v1beta1/namespaces/provisioning-8418/events                                                                                                      |   1
 5e1e42fd-7cb0-4113-9560-2f4883c4fabf | delete           | ResponseComplete | RequestResponse | /apis/apps/v1/namespaces/csi-mock-volumes-8269/statefulsets/csi-mockplugin-attacher                                                                                  |   1
 0209a47e-d27c-4f96-b22a-d9d37e759361 | update           | ResponseComplete | RequestResponse | /api/v1/namespaces/provisioning-3446/finalize                                                                                                                        |   1
 7cbec67f-e155-46b0-8d3e-8432df2d6594 | get              | ResponseComplete | Metadata        | /apis/snapshot.storage.k8s.io/v1alpha1?timeout=32s                                                                                                                   |   1
 b31171e3-f884-4d52-9b71-8d6d2ea2dfde | get              | ResponseComplete | Metadata        | /apis/coordination.k8s.io/v1?timeout=32s                                                                                                                             |   1
 f26a0ffe-f1cb-4dca-a5cc-f221b09f17d5 | create           | ResponseComplete | RequestResponse | /api/v1/namespaces/svc-latency-960/services                                                                                                                          |   1
 d3487667-f3e8-42d5-88f3-134706a916f9 | create           | ResponseComplete | RequestResponse | /apis/rbac.authorization.k8s.io/v1/clusterrolebindings                                                                                                               |   1
 1a83eb2c-59e0-4a50-81d2-b53470154b9c | list             | ResponseComplete | Request         | /api/v1/namespaces/var-expansion-9551/limitranges                                                                                                                    |   1
(40 rows)

#+end_src


#+BEGIN_SRC shell
# cat ~/ii/apisnoop/data-gen/cache/ci-kubernetes-e2e-gci-gce/1152045379034812417/kube-apiserver-audit.log \
cat ~/ii/apisnoop_v3/artifacts/ci-kubernetes-e2e-gci-gce/1152045379034812417/combined-audit.log \
  | jq -c '. | select( .auditID | contains("003bd7aa-0e61-46a3-9920-fef0abd2f08e"))' \
  | jq .stage 
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
#+end_EXAMPLE


In particular where every row is the same:

#+NAME: four of the same 
#+BEGIN_SRC  sql-mode
   select *
  --  select audit_id, stage 
     from audit_events
    where audit_id = '003bd7aa-0e61-46a3-9920-fef0abd2f08e'
    order by stage;
#+END_SRC

#+RESULTS: four of the same
#+begin_src sql-mode
 audit_id | testrun_id | op_id | stage | level | verb | request_uri | user_agent | test_name | requestkind | requestapiversion | requestmeta | requestspec | requeststatus | responsekind | responseapiversion | responsemeta | responsespec | responsestatus | request_ts | stage_ts 
----------+------------+-------+-------+-------+------+-------------+------------+-----------+-------------+-------------------+-------------+-------------+---------------+--------------+--------------------+--------------+--------------+----------------+------------+----------
(0 rows)

#+end_src

#+RESULTS:
#+begin_src sql-mode
               auditid                |      testrunid      | opid |  level  | verb  |                                             requesturi                                              |                     useragent                      |                                                              testname                                                              | requestkind | requestapiversion | requestmeta | requestspec | requeststatus | responsekind | responseapiversion | responsemeta | responsespec | responsestatus |           timestamp           
--------------------------------------+---------------------+------+---------+-------+-----------------------------------------------------------------------------------------------------+----------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------+-------------+-------------------+-------------+-------------+---------------+--------------+--------------------+--------------+--------------+----------------+-------------------------------
 003bd7aa-0e61-46a3-9920-fef0abd2f08e | 1152045379034812417 |      | Request | watch | /api/v1/namespaces/provisioning-97/serviceaccounts?fieldSelector=metadata.name%3Ddefault&watch=true | e2e.test/v1.16.0 (linux/amd64) kubernetes/3f1cb97  |  [sig-storage] In-tree Volumes [Driver: gcepd] [Testpattern: Inline-volume (default fs)] subPath should support existing directory |             |                   | {}          | {}          | {}            |              |                    | {}           | {}           | {}             | 2019-07-19 03:03:04.788019+00
 003bd7aa-0e61-46a3-9920-fef0abd2f08e | 1152045379034812417 |      | Request | watch | /api/v1/namespaces/provisioning-97/serviceaccounts?fieldSelector=metadata.name%3Ddefault&watch=true | e2e.test/v1.16.0 (linux/amd64) kubernetes/3f1cb97  |  [sig-storage] In-tree Volumes [Driver: gcepd] [Testpattern: Inline-volume (default fs)] subPath should support existing directory |             |                   | {}          | {}          | {}            |              |                    | {}           | {}           | {}             | 2019-07-19 03:03:04.788019+00
 003bd7aa-0e61-46a3-9920-fef0abd2f08e | 1152045379034812417 |      | Request | watch | /api/v1/namespaces/provisioning-97/serviceaccounts?fieldSelector=metadata.name%3Ddefault&watch=true | e2e.test/v1.16.0 (linux/amd64) kubernetes/3f1cb97  |  [sig-storage] In-tree Volumes [Driver: gcepd] [Testpattern: Inline-volume (default fs)] subPath should support existing directory |             |                   | {}          | {}          | {}            |              |                    | {}           | {}           | {}             | 2019-07-19 03:03:04.788019+00
 003bd7aa-0e61-46a3-9920-fef0abd2f08e | 1152045379034812417 |      | Request | watch | /api/v1/namespaces/provisioning-97/serviceaccounts?fieldSelector=metadata.name%3Ddefault&watch=true | e2e.test/v1.16.0 (linux/amd64) kubernetes/3f1cb97  |  [sig-storage] In-tree Volumes [Driver: gcepd] [Testpattern: Inline-volume (default fs)] subPath should support existing directory |             |                   | {}          | {}          | {}            |              |                    | {}           | {}           | {}             | 2019-07-19 03:03:04.788019+00
(4 rows)

#+end_src

* Footnotes

# eval: (sql-connect connection (concat "*SQL: postgres:" connection "*"))
# sql-connection-alist: ((hasura (sql-product 'postgres) (sql-user "ygrrlqaucoxunc") (sql-database "d5a2ppmichmu74") (sql-port 5432) (sql-server "ec2-174-129-227-205.compute-1.amazonaws.com")))

# eval: (require 'ob-sql-mode)
# org-babel-load-languages: ((sql-mode . t)(sql . t)(tmate . t))
# org-babel-default-header-args:sql-mode: ((:product . "postgres")(:session . "data"))
# sql-connection-alist: ((hasura (sql-product 'postgres) (sql-user "postgres") (sql-database "data") (sql-port 5432) (sql-server "172.17.0.1")))
# connection: "hasura"
# sql-postgres-options: ("-P" "pager=off" "--no-password")

# Local Variables:
# End:

